Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: དེ་གཉིས་ཀྱི་ནང་ན་བློ་གྲོས་བཟང་པོ་ཞེས་བྱ་བ་དེ་ལ་རབ་ཏུ་སྦྱིན་པ་ཆེན་པོ་འདི་དག་ཕུལ་ཅིག་དང་།
en: You should make your magnificent offerings to the one called Sumati.

source: རྒྱལ་པོ་ཆེན་པོ་ཁྱོད་ཀྱིས་ལོ་བཅུ་གཉིས་ཀྱི་བར་དུ་མཆོད་སྦྱིན་བྱས་པ་དེའི་འབྲས་བུ་བས་བྲམ་ཟེའི་ཁྱེའུ་བློ་གྲོས་བཟང་པོ་དེ་ལ་རབ་ཏུ་སྦྱིན་པ་ཆེན་པོ་བྱིན་པ་དེའི་འབྲས་བུ་ཆེས་ཆེའོ་ཞེས་བྱས་སོ། །
en: Great King, the fruits of making such magnificent offerings to Sumati will be much greater than the fruits of all the ritual offerings you have performed these last twelve years.’

source: དེ་ནས་རྒྱལ་པོ་དེས་བསམས་པ།
en: “The king thought,

source: དེ་གཉིས་ཀྱི་ཕྱིར་ལྷས་ཀྱང་སྦྲན་པ་ལས་ན་དེ་གཉིས་ནི་བདག་ཉིད་ཆེ་བ་ཡིན་གོར་མ་ཆག་སྙམ་མོ། །
en: ‘These two young men must truly be great if the gods themselves are informing me about them.’

source: དེ་ནས་རྒྱལ་པོ་དེས་ཐག་རིང་པོ་ཞིག་ནས་བྲམ་ཟེའི་ཁྱེའུ་བྱད་བཞིན་བཟང་ཞིང་མཛེས་པ་དེ་གཉིས་འོང་བ་མཐོང་ངོ་། །
en: The king saw the young brahmins from a distance, their faces sweet and beautiful.

source: དེ་གཉིས་ཀྱང་མཆོད་སྦྱིན་བྱེད་པའི་གནས་དེར་འོངས་ནས་བྲམ་ཟེའི་གྲལ་དུ་སྐབས་བྱེ་བའི་སར་སྟན་ལ་འདུག་གོ། །
en: When they arrived at the ritual offering site, they took their seats in the row reserved for brahmins.

source: དེ་ནས་རྒྱལ་པོ་ནོར་ཅན་གྱི་བུས་དེ་གཉིས་མཐོང་ནས་བསམས་པ། བདག་ལ་ལྷས་སྦྲན་པའི་བློ་གྲོས་བཟང་པོ་ཞེས་བྱ་བ་དེ་ནི་འདི་ཡིན་གོར་མ་ཆག་སྙམ་ནས།
en: When King Vāsava saw the two of them, he thought, ‘No doubt this is the Sumati the gods were telling me about.’

source: རྒྱལ་པོ་དེ་གྲལ་དཔོན་གྱི་མདུན་དུ་སོང་སྟེ། བྲམ་ཟེའི་ཁྱེའུ་བློ་གྲོས་བཟང་པོ་ལ་དྲིས་པ།
en: “The king went to the row and asked the young brahmin Sumati,

source: ཁྱོད་བློ་གྲོས་བཟང་པོ་ཡིན་ནམ་དེས་སྨྲས་པ་ང་ཡིན་ནོ། །
en: ‘Are you the brahmin Sumati?’ “ ‘I am he,’ he replied.

source: དེ་ནས་རྒྱལ་པོ་ནོར་ཅན་གྱི་བུས་བྲམ་ཟེའི་ཁྱེའུ་བློ་གྲོས་བཟང་པོ་གྲལ་དཔོན་དུ་བཞག་སྟེ་ཟན་བྱིན་ནས། རབ་ཏུ་སྦྱིན་པར་བྱ་བ་ཆེན་པོ་རྣམ་པ་ལྔ་པོ་དེ་དག་བྱིན་པ་ལས།
en: “Then King Vāsava placed the young brahmin at the head of the row, gave him food, and presented him with the five magnificent offerings.

source: བྲམ་ཟེའི་ཁྱེའུ་བློ་གྲོས་བཟང་པོས་རབ་ཏུ་སྦྱིན་པ་ཆེན་པོས་གསེར་གྱི་འཁར་བ་དང་རིལ་བ་ལ་སོགས་པ་བཞི་ནི་བླངས་རབ་ཏུ་སྦྱིན་པའི་ནང་ནས་བུ་མོ་གཅིག་པུ་ནི་མ་བླངས་ཏེ
en: The young brahmin Sumati accepted four of the great gifts: the golden staff, the vase, and so forth. But he left one of the magnificent offerings aside—the only gift he did not accept was that of the young woman.

source: བདག་ནི་ཚངས་པར་སྤྱོད་པ་ཡིན་ནོ་ཞེས་ཟེར་རོ། །
en: He explained, ‘I am practicing the holy life.’

source: དེ་ནས་བུ་མོ་དེས་བྲམ་ཟེའི་ཁྱེའུ་བློ་གྲོས་བཟང་པོ་བྱད་བཞིན་བཟང་ཞིང་མཛེས་པ་མཐོང་ནས། ཆགས་ཤིང་སྙིང་དུ་སྡུག་པར་གྱུར་ཏེ།
en: “The young woman saw that the young brahmin Sumati was well proportioned and beautiful, and she became quite attached to him and fell in love.

source: ཁྱེའུ་བློ་གྲོས་བཟང་པོ་དེ་ལ་སྨྲས་པ།
en: She said to the young brahmin Sumati,

source: བྲམ་ཟེའི་ཁྱེའུ་བདག་བཞེས་ཤིག །
en: ‘Brahmin Sumati, please, accept me.’

source: དེས་སྨྲས་པ། བདག་གིས་བླང་དུ་མི་རུང་ངོ་། །
en: “ ‘It wouldn’t be right for me to do so,’ he said.

source: དེ་ནས་བུ་མོ་དེ་རྒྱལ་པོས་ཀྱང་རབ་ཏུ་སྦྱིན་པའི་བསམ་པས་ཡོངས་སུ་བཏང་སྟེ། ཕྱིར་མ་ཁྱེར་ལ་བྲམ་ཟེའི་ཁྱེའུ་བློ་གྲོས་བཟང་པོས་ཀྱང་མ་བླངས་ནས། རྒྱལ་པོ་མར་མེའི་གྲོང་ཁྱེར་མར་མེ་ལྡན་དུ་སོང་ངོ་། །
en: “Since the king had set her at liberty, expecting to give her away, and the young brahmin Sumati had refused her as well, the young woman traveled to Dīpavatī, the royal city of King Dīpa.

source: དེ་དེར་སོང་ནས་རང་གི་རྒྱན་རྣམས་ལུས་ལས་བཀྲོལ་ཏེ། མེ་ཏོག་ཕྲེང་བ་རྒྱུད་པ་ལ་བྱིན་ནས།
en: When she got there, she removed all the adornments from her body and handed them to a flower-garland maker.

source: རྒྱན་འདི་རིན་ཆེ་བ་ཡིན་གྱིས་ང་ལ་ཉིན་གཅིག་བཞིན་དུ་ལྷའི་མཆོད་པར་ཨུད་པ་ལ་སྔོན་པོ་བྱིན་ཅིག་ཅེས་བྱས་སོ། །
en: “ ‘These adornments are very valuable,’ she said, ‘so now, every day, you must give me a blue lotus so that I can worship my deity.’

source: དེ་ནས་དེས་དེའི་ལུང་བཞིན་དུ་གསེར་གྱི་རྒྱན་དེ་བྱིན་ཏེ་ལྷའི་རིམ་གྲོ་བྱེད་པར་གྱུར་ཏོ། །
en: After handing him the golden adornments just as she had said, she began her veneration of the deity.

source: བྲམ་ཟེའི་ཁྱེའུ་བློ་གྲོས་བཟང་པོ་དེ་ཡང་རབ་ཏུ་སྦྱིན་པ་ཆེན་པོ་བཞི་པོ་དེ་དག་ཁྱེར་ཏེ་མཁན་པོའི་ཐད་དུ་སོང་ངོ་། །
en: “Meanwhile, the young brahmin Sumati gathered up all four of the other magnificent offerings and approached his preceptor.

source: སོང་ནས་ཀྱང་རབ་ཏུ་སྦྱིན་པ་ཆེན་པོ་རྣམ་པ་བཞི་པོ་དེ་དག་མཁན་པོ་ལ་ཕུལ་ལོ། །
en: When he got there he presented all four of those magnificent offerings to his preceptor.

source: མཁན་པོས་ཀྱང་དེ་རྣམས་ཀྱི་ནང་ནས་རྣམ་པ་གསུམ་ནི་བླངས་ཀཱར་ཥཱ་པ་ཎ་ལྔ་བརྒྱ་ནི་བློ་གྲོས་བཟང་པོ་དེ་ཉིད་ལ་བྱིན་ནོ། །
en: Of those four, the preceptor likewise kept only three and gave the five hundred gold coins back to Sumati.

source: བློ་གྲོས་བཟང་པོས་ཀྱང་དེ་ཁོ་ནའི་ནུབ་མོ་རྨི་ལམ་རྣམ་པ་བཅུ་རྨིས་ཏེ། རྒྱ་མཚོ་ཆེན་པོ་བཏུང་ངོ་སྙམ་པ་དང་། ནམ་མཁའ་ལ་འགྲོའོ་སྙམ་པ་དང་། ཉི་མ་དང་ཟླ་བ་མཐུ་ཆེ་བ་འདི་གཉིས་ལག་པས་རེག་ཅིང་གཟུང་བར་བྱའོ་སྙམ་པ་དང་། རྒྱལ་པོ་རྣམས་ཤིང་ཁྱེར་དུ་གཞུག་གོ་སྙམ་པ་དང་། དྲང་སྲོང་རྣམས་དང་། གླང་པོ་ཆེ་དཀར་པོ་རྣམས་དང་། ངང་པ་རྣམས་དང་། སེང་གེ་རྣམས་དང་། བྲག་ཆེན་པོ་ལ་བཞོན་པར་བྱའོ་སྙམ་སྟེདེས་རྨི་ལམ་དེ་རྣམས་རྨིས་ནས་སད་དོ། །
en: “That night Sumati had ten different dreams: that he was drinking a great ocean; that he was flying; that he touched the radiant sun and moon and took them up into his arms; that he caused kings to carry a chariot; and that he rode atop a sage, a white elephant, a swan, a lion, and a great boulder.

source: སད་ནས་དེས་བསམས་པ། བདག་གི་རྨི་ལམ་འདི་རྣམས་ལུང་སྟོན་ནུས་པ་སུ་ཡོད་སྙམ་མོ། །
en: He awoke from these dreams, and when he did, he wondered who might prophesy about their significance.

source: དེ་ནས་ཐག་མི་རིང་བ་ཞིག་ན་དྲང་སྲོང་མངོན་པར་ཤེས་པ་ལྔ་དང་ལྡན་པ་ཞིག་གནས་སོ། །
en: “Not far off there lived a sage who had all the five superknowledges.

source: དེ་ནས་བྲམ་ཟེའི་ཁྱེའུ་བློ་གྲོས་བཟང་པོ་ཐེ་ཚོམ་གཅད་པའི་ཕྱིར། དྲང་སྲོང་དེའི་ཐད་དུ་སོང་ནས་
en: The young brahmin Sumati approached the sage to dispel his doubts about his dreams.

source: བློ་གྲོས་བཟང་པོས་དྲང་སྲོང་དེ་ལ་ཀུན་དུ་དགའ་བའི་གཏམ་བྱས་ནས་རྨི་ལམ་དེ་རྣམས་བསྙད་དེ
en: He made pleasant conversation with him, told him about his dreams, and made his request, saying,

source: ཁྱོད་ཀྱིས་རྨི་ལམ་རྣམ་པ་བཅུ་པོ་འདི་རྣམས་ཀྱི་དོན་ངེས་པར་གྱིས་ཤིག་ཅེས་བྱས་སོ། །
en: ‘Please divine the meaning of these ten dreams.’

source: དེ་ནས་དྲང་སྲོང་དེས་སྨྲས་པ། བདག་གིས་རྨི་ལམ་འདི་རྣམས་ལུང་སྟོན་མི་ནུས་ཀྱིས་རྒྱལ་པོའི་ཕོ་བྲང་མར་མེ་ལྡན་དུ་སོང་ཤིག་དང་།
en: “ ‘I cannot divine your dreams,’ the sage told him. ‘You should go to the royal palace of Dīpavatī instead.

source: དེ་ན་རྒྱལ་པོ་མར་མེས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མར་མེ་མཛད་ཞབས་ས་ལ་རེག་པར་བྱ་བའི་ཕྱིར། གྲོང་ཁྱེར་གྱི་ནང་དུ་སྤྱན་དྲངས་ཏེ།
en: King Dīpa has invited the totally and completely awakened Buddha Dīpaṃkara so that his feet might touch the ground there.

source: དེས་རྨི་ལམ་འདི་རྣམས་ལུང་སྟོན་པར་འགྱུར་རོ་ཞེས་བྱས་སོ། །
en: He will divine these dreams for you.’

source: དེ་ནས་རྒྱལ་པོ་ནོར་ཅན་གྱི་བུ་དེས་རྒྱལ་པོ་མར་མེས་སྤྲིང་བ་བཞིན་དུ་མཉན་ཏེ། བློན་པོ་བརྒྱད་ཁྲིས་ཞབས་འབྲིང་བྱས་ནས་རྒྱལ་པོའི་ཕོ་བྲང་མར་མེ་ལྡན་དུ་ཕྱིན་ཏོ། །
en: “King Vāsava, heeding King Dīpa’s message, had gone to King Dīpa’s palace with a suite of eighty thousand ministers.

source: རྒྱལ་པོ་མར་མེས་ཀྱང་ཞག་བདུན་ལོན་ནས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མར་མེ་མཛད་ཞབས་ས་ལ་རེག་པར་བྱ་བའི་ཕྱིར། གྲོང་ཁྱེར་གྱི་ནང་དུ་སྤྱན་དྲང་བར་བྱའོ་སྙམ་སྟེ
en: After seven days had passed, King Dīpa thought, ‘I shall invite the totally and completely awakened Buddha Dīpaṃkara into the city so that his feet might touch the ground here.’

source: ཡུལ་དང་གྲོང་ཁྱེར་ཐམས་ཅད་ནས་མེ་ཏོག་ཐམས་ཅད་བསྡུས་སོ། །
en: He began to gather all the flowers from the city and the surrounding countryside.

source: དེར་གང་གི་ཉིན་པར་རྒྱལ་པོ་མར་མེས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མར་མེ་མཛད་ཞབས་ས་ལ་རེག་པར་བྱ་བའི་ཕྱིར།
en: Then the day arrived on which King Dīpa had invited the totally and completely awakened Buddha Dīpaṃkara to come to the city so that his feet might touch the ground there.

source: གྲོང་ཁྱེར་གྱི་ནང་དུ་སྤྱན་འདྲེན་པ་དེའི་ཉིན་པར་བློ་གྲོས་བཟང་པོ་ཡང་དེར་འོངས་ནས
en: “This was also the same day on which the young brahmin Sumati arrived.

source: དེར་རྒྱལ་པོ་དེས་མེ་ཏོག་ཐམས་ཅད་བསྡུས་པར་གྱུར་ཏོ། །བུ་མོ་ལྷའི་རིམ་གྲོ་བྱེད་པ་དེ་ཡང་མེ་ཏོག་ཕྲེང་བ་རྒྱུད་པའི་ཐད་དུ་སོང་ནས་ལྷའི་མཆོད་པ་བྱ་དགོས་ཀྱིས་བདག་ལ་ཨུད་པ་ལ་སྔོན་པོ་བྱིན་ཅིག་ཅེས་བྱས་སོ། །
en: The king had already gathered up all the flowers, so when the young woman, thinking to venerate her deity, went to the flower-garland maker and said, ‘One blue lotus, please, for the veneration of my deity,’

source: མེ་ཏོག་ཕྲེང་བ་རྒྱུད་པས་སྨྲས་པ། དེང་རྒྱལ་པོས་སངས་རྒྱས་སྤྱན་དྲང་བའི་ཕྱིར་མེ་ཏོག་ཐམས་ཅད་བསྡུས་སོ། །
en: the garland maker replied, ‘Today the king has gathered up all the flowers for the Buddha’s arrival.’

source: དེས་སྨྲས་པ། མེ་ཏོག་གི་རྫིང་དེར་སོང་ལ་ཡང་ལྟོས་ཤིག་དང་གལ་ཏེ་བདག་གི་བསོད་ནམས་ཀྱིས་ཨུད་པ་ལ་སྔོན་པོ་མ་བཏོགས་པ་རྙེད་ཀྱང་སྲིད་དོ། །
en: “ ‘Go and look in that flower pond, there,’ she replied, ‘for, because of my merit, you may find a blue lotus there that has not been plucked.’

source: དེ་ནས་མེ་ཏོག་གི་རྫིང་དེར་བློ་གྲོས་བཟང་པོའི་བསོད་ནམས་ཀྱི་མཐུས་ཨུད་པ་ལ་སྔོན་པོ་བདུན་བྱུང་ངོ་། །
en: “By the power of Sumati’s merit, seven blue lotuses had indeed appeared in the lotus pond.

source: དེ་ནས་མེ་ཏོག་གི་ཕྲེང་བ་རྒྱུད་པ་དེ་སོང་ནས་དེས་མཐོང་ངོ་། །མཐོང་ནས་ཀྱང་བུ་མོ་དེས་མེ་ཏོག་ཕྲེང་བ་རྒྱུད་པ་ལ་སྨྲས་པ།
en: The garland maker went there and saw them, and the young woman asked him,

source: ཨུད་པ་ལ་འདི་རྣམས་ཐོགས་ཤིག །
en: ‘Can you pluck those blue lotuses for me?’

source: མེ་ཏོག་ཕྲེང་བ་རྒྱུད་པས་སྨྲས་པ། བླ་ནས་བདག་ལ་གྱོད་རྨས་སུ་འོང་གིས་བདག་གིས་བཏོག་ཏུ་མི་རུང་ངོ་། །
en: The garland maker responded, ‘I cannot pluck them. His Highness will punish me.’

source: དེ་ནས་དེས་སྨྲས་པ། ཁྱོད་ཀྱིས་སྔར་མེ་ཏོག་ཐམས་ཅད་བཏོགས་ཏེ། རྒྱལ་པོ་ལ་མ་ཕུལ་ལམ། མེ་ཏོག་ཕྲེང་བ་རྒྱུད་པས་སྨྲས་པ་ཕུལ་ལོ། །
en: “ ‘You plucked all the flowers before to offer to the king, didn’t you?’ she asked. “ ‘Yes, I did,’ he replied.

source: དེ་ནས་བུ་མོ་དེས་སྨྲས་པ། འདི་དག་ནི་བདག་གི་བསོད་ནམས་ལས་སྐྱེས་པ་ཡིན་གྱིས། འདི་རྣམས་ཐོགས་ལ་བདག་ལ་བྱིན་ཅིག །
en: “ ‘Then it is by the power of my merit that these have grown,’ said the young woman, ‘so pluck them, please, and give them to me.’

source: མེ་ཏོག་ཕྲེང་བ་རྒྱུད་པས་སྨྲས་པ། བླ་ནས་མ་ཚོར་བར་འདི་དག་ཇི་ལྟར་ཁྱེར་བར་བྱ།
en: The garland maker asked her, ‘How will you carry them away from the lake without His Highness seeing you?’

source: བུ་མོས་སྨྲས་པ། བདག་གི་བསོད་ནམས་ཀྱི་མཐུ་ལས་བྱུང་བ་ཡིན་གྱིས་ཐོགས་ཤིག་དང་།
en: “ ‘They grew by the power of my merit,’ said the young woman, ‘so please pick them.

source: བདག་གིས་ཆུའི་བུམ་པའི་ནང་དུ་བཅུག་སྟེ་ནང་དུ་བསྐུར་བར་བྱའོ། །
en: I’ll hide them in my water jug, and carry them that way.’

source: དེ་ནས་མེ་ཏོག་ཕྲེང་བ་རྒྱུད་པས་དེ་སྐད་ཅེས་ཐོས་ནས། དེ་དག་བཏོགས་ཏེ་བུ་མོ་དེ་ལ་བྱིན་ནོ། །
en: Reassured, the garland maker plucked the flowers and gave them to the young woman.

source: དེས་ཀྱང་བླངས་ནས་ཆུའི་བུམ་པའི་ནང་དུ་བཅུག་སྟེ། བུམ་པ་དེ་ཆུས་བཀང་ནས་གྲོང་ཁྱེར་གྱི་ནང་དུ་ཆས་སོ། །
en: She took them and put them inside her water jug, then filled the jug with water and set out for the city.

source: བློ་གྲོས་བཟང་པོ་ཡང་གྲོང་ཁྱེར་གྱི་ནང་དེར་ཕྱིན་ནས་དེས་བསམས་པ།
en: “Sumati had already arrived in the city, and he thought to himself,

source: བདག་གིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་མི་བྱར་ག་ལ་རུང་སྙམ་སྟེ།
en: ‘It’s not right of me to be without an offering for the Blessed One.’

source: དེས་མེ་ཏོག་ཕྲེང་བ་རྒྱུད་པའི་ཁྱིམ་རྣམས་བསྐོར་ཏེ། མེ་ཏོག་གོ་ཅོག་བཙལ་ན་མེ་ཏོག་གཅིག་ཀྱང་མ་རྙེད་དོ། །
en: He went around to the homes of all the flower-garland makers, hoping for any kind of flower, but he could not find a single one.

source: དེ་ནས་གྲོང་ཁྱེར་གྱི་ནུབ་སྒོ་ནས་བྱུང་སྟེ། ཀུན་དགའ་ར་བ་ནས་ཀུན་དགའ་ར་བར་བསྐོར་ཏེ། མེ་ཏོག་རྣམས་བཙལ་ཀྱང་མེ་ཏོག་གཅིག་ཀྱང་མ་རྙེད་དོ། །
en: When at last he emerged from the western gate of the city, he circled from garden to garden, hoping for any kind of flower, but still he could not find a single one.

source: དེ་ནས་འཁོར་འཁོར་ཏེ་སྐྱེད་མོས་ཚལ་དེར་ཕྱིན་ནས། བུ་མོ་དེ་ཡང་སྐྱེད་མོས་ཚལ་དེ་ནས་བྱུང་སྟེ། བྲམ་ཟེའི་ཁྱེའུ་བློ་གྲོས་བཟང་པོ་དང་ཐད་ཀར་ཕྲད་དོ། །
en: “Then, after circling all about, the young brahmin Sumati was walking into a garden just as the young woman was coming out of it and he bumped right into her.

source: དེ་ནས་བློ་གྲོས་བཟང་པོའི་བསོད་ནམས་ཀྱི་མཐུས་མེ་ཏོག་ཨུད་པ་ལ་དེ་དག་ཆུའི་བུམ་པ་དེའི་ནང་ནས་གྱེན་དུ་འཐོན་ཏོ། །
en: By the power of Sumati’s merit, all the blue lotus flowers rose out of the water jar.

source: དེ་ནས་བློ་གྲོས་བཟང་པོས་མེ་ཏོག་དེ་དག་མཐོང་ནས། བུ་མོ་དེ་ལ་སྨྲས་པ། ང་ལས་རིན་ཀཱར་ཥཱ་པ་ཎ་ལྔ་བརྒྱ་ལོང་ལ་ཨུད་པ་ལ་འོ་ནི་རྣམས་ང་ལ་བྱིན་ཅིག །
en: “When he saw the flowers, Sumati said to the young woman, ‘I’ll pay you five hundred gold coins to give me all those blue lotuses.’

source: བུ་མོ་དེས་སྨྲས་པ། དེའི་ཚེ་ཁྱོད་ཀྱིས་བདག་བཞེས་སུ་མ་གནང་ན།
en: “ ‘You wouldn’t accept me before,’ the young woman replied.

source: ད་ཨུད་པ་ལ་རྣམས་བཞེད་དམ། བདག་མི་དབུལ་ལོ་ཞེས་དེ་སྐད་སྨྲས་ནས།
en: ‘Now you want my lotuses? I won’t offer them to you.’

source: ཡང་བྲམ་ཟེའི་ཁྱེའུ་བློ་གྲོས་བཟང་པོ་ལ་སྨྲས་པ། འདི་རྣམས་ཀྱིས་ཅི་ཞིག་བགྱི།
en: But having said this, she asked the young brahmin Sumati, ‘What do you want them for?’

source: བློ་གྲོས་བཟང་པོས་སྨྲས་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པར་བྱའོ། །
en: “ ‘To offer to the Blessed One,’ Sumati replied.

source: དེའི་འོག་ཏུ་བུ་མོ་དེས་སྨྲས་པ། བདག་ལ་ཀཱར་ཥཱ་པ་ཎ་ཅང་མི་འཚལ་གྱིས་གལ་ཏེ་ཁྱོད་ལ་ཨུད་པ་ལ་འདི་དག་ཕུལ་བའི་འབྲས་བུས། ཚེ་རབས་ཐམས་ཅད་དུ་བདག་ཁྱོད་ཀྱི་བཙུན་མོར་འགྱུར་བར་བཞེད་དེ
en: The young woman said, ‘I don’t need your gold coins. I want the result of offering you these blue lotuses to be that throughout all our lives I become your queen.

source: གལ་ཏེ་སྦྱིན་པ་འདི་སྦྱིན་པ་ན་ཚེ་རབས་ཐམས་ཅད་དུ་ཁྱོད་བདག་གི་ཆུང་མར་གྱུར་ཅིག་ཅེས་དེ་སྐད་དུ་སྨོན་ལམ་འདེབས་ན་ནི། བདག་གིས་ཡེ་དབུལ་བར་འཚལ་ལོ། །
en: I’ll give them to you if you’ll pray, ‘By giving me this gift, in all our lives may she be my wife.’

source: བློ་གྲོས་བཟང་པོས་སྨྲས་པ། ང་ནི་སྦྱིན་པ་ལ་དགའ་བ་ཡིན་ཏེ། བདག་གི་ཆུང་མ་དང་བུ་ཡང་ཡོངས་སུ་གཏོང་ལ།
en: “ ‘I’m a person who takes joy in giving,’ Sumati said, ‘one who would give away his wife and child.

source: བདག་གི་ཤ་ཡང་ཡོངས་སུ་གཏོང་བར་བྱེད་དོ། །
en: I would even give away my own flesh.’

source: བུ་མོ་དེས་སྨྲས་པ། ཇི་སྨོན་ལམ་དེ་ལྟར་ཐོབ་ལ་སླད་ཀྱིས་སུ་ཅི་འདོད་པ་དེ་ལ་བདག་སྩོལ་ཅིག །
en: “ ‘First, pray that it be so,’ the young woman said. ‘After that, you can give me to whomever you please.’

source: བུ་མོ་དེས་བློ་གྲོས་བཟང་པོ་ལ་ཨུད་པ་ལ་ལྔ་བྱིན་ནོ། །
en: With this, the young woman handed five lotuses to Sumati.

source: གཉིས་ནི་བདག་ཉིད་ཀྱིས་ཁྱེར་ནས་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: She took the remaining two herself and recited the following verse:

source: ཁྱོད་ཀྱིས་གང་དུ་སྨོན་པ་ཡི། །འདྲེན་པ་སངས་རྒྱས་བརྙེས་པ་དེར། རྟག་ཏུ་འཐུན་པར་ཆོས་སྤྱོད་པའི། །ཁྱོད་ཀྱི་བཙུན་མོར་བདག་གྱུར་ཅིག །
en: “ ‘Whenever your prayers are fulfilled And you become a guide, a buddha, May I be your queen—a constant aide To your Dharma practice.’

source: དེ་ནས་རྒྱལ་པོ་དེས་གྲོང་ཁྱེར་དེ་དག་ཐམས་ཅད་རྡོ་དང་། གསེག་མ་དང་། གྱོ་མོ་མེད་པར་བྱས་ནས། རྒྱལ་མཚན་དང་། བ་དན་དང་། རྟ་བབས་རྣམས་ནི་བཙུགས། དར་གྱི་ལྡ་ལྡི་རྣམས་ནི་བྲེས། སྤོས་ཆབ་དང་། ཕྱེ་མ་རྣམས་ཀྱིས་ནི་གཏོར་ཏོ། །
en: “Meanwhile, after having the entire city cleared of stones, pebbles, and gravel, the king ordered that banners and flags be hoisted, archways festooned, silk tassels hung, and fragrant water and incense powder scattered about.

source: གྲོང་ཁྱེར་གྱི་སྒོ་ནས་གཙུག་ལག་ཁང་གི་བར་དུ་ཡང་རྡོ་དང་། གསེག་མ་དང་། གྱོ་མོ་རྣམས་མེད་པར་བྱས་ནས། རྒྱལ་མཚན་དང་། བ་དན་དང་། རྟ་བབས་ནི་བཙུགས། དར་གྱི་ལྡ་ལྡི་ནི་བྲེས། སྤོས་ཆབ་དང་། ཕྱེ་མས་ནི་གཏོར་ཏོ། །
en: And when the stones, pebbles, and gravel had been cleared from the city gates up to the monastery, and banners, flags, and pediments set in place, silk tassels hung, and fragrant water and incense powder scattered about,

source: རྒྱལ་པོ་དེ་ཉིད་ཀྱིས་ཀྱང་གདུགས་རྩིབས་བརྒྱ་པ་ཐོགས་ནས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མར་མེ་མཛད་བསུའོ། །
en: the king, carrying a hundred-ribbed parasol, went out to receive the totally and completely awakened Buddha Dīpaṃkara.

source: དེ་བཞིན་དུ་བློན་པོ་རྣམས་ཀྱིས་ཀྱང་བསུའོ། །དེ་བཞིན་དུ་རྒྱལ་པོ་ནོར་ཅན་གྱི་བུ་བློན་པོ་དང་བཅས་པ་རྣམས་ཀྱིས་ཀྱང་བསུའོ། །
en: “The ministers likewise went out to receive him, as did King Vāsava and his ministers.

source: དེ་ནས་རྒྱལ་པོས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ
en: The king touched his head to the feet of the Blessed One and implored him,

source: བཅོམ་ལྡན་འདས་གྲོང་ཁྱེར་དུ་གཤེགས་སུ་གསོལ་ཞེས་གསོལ་བ་བཏབ་ནས།
en: ‘Blessed One, may it please you to enter the city.’

source: བཅོམ་ལྡན་འདས་དེ་དགེ་སློང་གི་དགེ་འདུན་གྱིས་མདུན་དུ་བདར་ཏེ། གྲོང་ཁྱེར་ལོགས་སུ་ཆས་ཏེ་གཤེགས་སོ། །
en: The Blessed One, accompanied by the saṅgha of monks, turned to face the city, and began to walk,

source: རྒྱལ་པོ་མར་མེ་ཡང་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མར་མེ་མཛད་ཀྱི་སྟེང་དུ་གདུགས་རྩིབས་བརྒྱ་པ་ཐོགས་སོ། །
en: as King Dīpa held the hundred-ribbed parasol steady over the totally and completely awakened Buddha Dīpaṃkara.

source: དེ་བཞིན་དུ་བློན་པོ་རྣམས་དང་། རྒྱལ་པོ་ནོར་ཅན་གྱི་བུ་བློན་པོ་དང་བཅས་པ་རྣམས་ཀྱང་གདུགས་ཐོགས་སོ། །
en: “The ministers, along with King Vāsava and his ministers, also all held their parasols over him,

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཅི་ནས་རེ་རེ་ནས་ད་བདག་ནི་བཅོམ་ལྡན་འདས་ཀྱི་གདུགས་ཐོགས་སོ། །
en: [and the Blessed One emanated himself in such a way that each of them thought,] ‘I’m the one holding a parasol over the Blessed One!’and the

source: སྙམ་དུ་སེམས་པར་འགྱུར་བ་དེ་ལྟ་བུར་རྫུ་འཕྲུལ་གྱི་བྱིན་གྱིས་བརླབས་སོ། །
en: Blessed One emanated himself in such a way that each of them thought, [‘I’m the one holding a parasol over the Blessed One!’]

source: དེ་ནས་བཅོམ་ལྡན་འདས་དེ་ལྟ་བུའི་མཛེས་པ་དང་ལྡན་པས་གྲོང་ཁྱེར་གྱི་སྒོར་གཤེགས་ནས། དེར་བཅོམ་ལྡན་འདས་ཀྱིས་ཆེད་དུ་མཛད་དེ། སྒོའི་ཐེམ་པ་ལ་ཞབས་བཞག་ནས།
en: The Blessed One, in all his splendor, came to the city gate, assumed authority, and placed his foot upon the threshold.

source: གང་གི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་སྒོའི་ཐེམ་པ་ལ་ཞབས་བཞག་པ་དེ་ཁོ་ནའི་མོད་ལ་ས་རྣམ་པ་དྲུག་ཏུ་གཡོས་ཏེ། འགུལ་རབ་ཏུ་འགུལ། ཀུན་དུ་རབ་ཏུ་འགུལ། ལྡེག་རབ་ཏུ་ལྡེག །ཀུན་དུ་རབ་ཏུ་ལྡེག་པར་གྱུར་ཏོ། །
en: The moment that the Blessed One placed his foot upon the threshold the earth quaked six different ways: it quivered, shuddered, and jolted; it trembled, shook, and swayed.

source: ཆོས་ཉིད་ཀྱིས་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་གང་གི་ཚེ་ཆེད་དུ་མཛད་དེ།
en: “Whenever the blessed ones assume authority

source: སྒོའི་ཐེམ་པ་ལ་ཞབས་འཇོག་པ་ན་ངོ་མཚར་རྨད་དུ་བྱུང་བའི་ཆོས་རྣམ་པ་སྣ་ཚོགས་འབྱུང་བར་འགྱུར་ཏེ།
en: and set foot upon the threshold of a city gate all manner of marvels naturally take place.

source: སྨྱོན་པ་རྣམས་ཀྱིས་ནི་རང་བཞིན་གྱིས་སེམས་ཐོབ་པར་འགྱུར་རོ། །
en: Persons with psychosis find their minds regain their function.

source: ལོང་བ་རྣམས་ནི་མིག་གིས་མཐོང་བར་འགྱུར་རོ། །
en: Persons with blindness find their eyes can see.

source: འོན་པ་རྣམས་ནི་རྣ་བས་ཐོས་པར་འགྱུར་རོ། །
en: Persons with deafness find their ears can hear.

source: ལྐུགས་པ་རྣམས་ནི་སྨྲ་ནུས་པར་འགྱུར་རོ། །
en: Persons with speech disabilities find themselves able to speak.

source: འཕྱེ་བོ་རྣམས་ནི་འགྲོ་ནུས་པར་འགྱུར་རོ། །
en: Persons with impediments to their mobility find that they can walk.

source: བུད་མེད་བུ་འབྱུང་དུ་མི་བཏུབ་པ་རྣམས་ནི་བདེ་བར་བཙས་པར་འགྱུར་རོ། །
en: Persons unable to have children find themselves happily bringing forth.

source: ཤིང་མིག་གི་གདོས་དང་རྐང་སྒྲིལ་དང་། ཨན་པན་བཏགས་པའི་སེམས་ཅན་རྣམས་ནི་བཅིངས་པ་ལས་གྲོལ་བར་འགྱུར་རོ། །
en: Sentient beings who are pilloried, or whose feet are bound or locked in stocks, find themselves liberated from bondage.

source: ཆུང་ངུ་ནས་འཁོན་བྱུང་བ་རྣམས་ནི་དེ་མ་ཐག་ཏུ་བྱམས་པའི་སེམས་ཐོབ་པར་འགྱུར་རོ། །
en: Persons of lifelong enmity achieve, in an instant, minds of love.

source: བེའུ་རྣམས་ནི་བེའུ་གདང་བཅད་དེ་མའི་ཐད་དུ་འདོང་བར་བྱེད་དོ། །
en: Calves break their ropes and go to their mothers.

source: གླང་པོ་ཆེ་རྣམས་ཀྱང་སྐད་འབྱིན་ཏོ། །
en: Elephants trumpet.

source: རྟ་རྣམས་ཀྱང་སྐད་འབྱིན་ཏོ །
en: Horses bray.

source: ཁྱུ་མཆོག་རྣམས་ཀྱང་སྐད་འབྱིན་ཏོ། །
en: The head of every herd sounds a signal cry.

source: ནེ་ཙོ་དང་། རི་སྐེགས་དང་། ཁུ་བྱུག་དང་། ཤང་ཤང་ཏེའུ་རྣམས་ཀྱང་སྐད་སྙན་པ་འབྱིན་ཏོ། །
en: Parrots, mountain birds, cuckoos, and jīvaṃjīva birds each call out their songs.

source: རོལ་མོའི་ཆ་བྱད་རྣམས་ཀྱང་མ་བརྡུངས་པར་སྒྲ་སྙན་པ་འབྱིན་ཏོ། །
en: “Musical instruments resound without being played.

source: རྒྱན་སྣོད་དུ་བཅུག་པ་རྣམས་ཀྱང་སྒྲ་སྙན་པ་འབྱིན་ཏོ། །
en: Ornaments jingle inside their containers.

source: ས་ཕྱོགས་མཐོ་བ་རྣམས་ནི་དམའ་བར་འགྱུར། དམའ་བ་རྣམས་ནི་མཐོ་བར་འགྱུར་རོ། །
en: The highlands sink down and the lowlands rise up.

source: རྡོ་དང་། གསེག་མ་དང་། གྱོ་མོ་རྣམས་ཀྱང་མེད་པར་འགྱུར་རོ། །
en: Stones, pebbles, and gravel all disappear.

source: ལྷ་རྣམས་ཀྱང་བར་སྣང་ལས་ལྷའི་མེ་ཏོག་ཨུད་པ་ལ་དང་། པད་མ་དང་། ཀུ་མུ་ད་དང་། པད་མ་དཀར་པོ་རྣམས་འཐོར་བར་བྱེད་དོ། །ཨ་ག་རུའི་ཕྱེ་མ་དང་། རྒྱ་སྤོས་ཀྱི་ཕྱེ་མ་དང་། ཙན་དན་གྱི་ཕྱེ་མ་དང་། ཏ་མ་ལའི་ཕྱེ་མ་རྣམས་དང་། ལྷའི་མེ་ཏོག་མན་དཱ་ར་བ་རྣམས་ཀྱང་འཐོར་བར་བྱེད་དོ། །
en: The gods in the sky let fall divine blue lotus, white water lily, and white lotus flowers, and scatter agaru powder, fragrant tagara powder, sandalwood powder, tamala powder, and divine mandārava flowers as well.

source: ཤར་ཕྱོགས་དམའ་ན་ནུབ་ཕྱོགས་མཐོ།
en: The east sinks down and the west rises up.

source: ནུབ་ཕྱོགས་དམའ་ན་ཤར་ཕྱོགས་མཐོ།
en: The west sinks dow and the east rises up.

source: ལྷོ་ཕྱོགས་དམའ་ན་བྱང་ཕྱོགས་མཐོ།
en: The south sinks down and the north rises up.

source: བྱང་ཕྱོགས་དམའ་ན་ལྷོ་ཕྱོགས་མཐོ།
en: The north sinks down and the south rises up.

source: དབུས་དམའ་ན་མཐའ་མཐོ།
en: The middle sinks down and the edges rise up.

source: མཐའ་དམའ་ན་དབུས་མཐོ་བར་འགྱུར་རོ། །
en: The edges sink down and the middle rises up.

source: རྒྱལ་པོའི་ཕོ་བྲང་མར་མེ་ལྡན་དེ་ན་སྲོག་ཆགས་འབུམ་ཕྲག་དུ་མ་མེ་ཏོག་དང་། བདུག་པ་དང་། སྤོས་རྣམས་ཀྱིས་བཀུར་སྟི་བྱེད་དོ། །
en: “At the royal palace of Dīpavatī, a crowd of hundreds of thousands of beings worshiped the Blessed One with flowers and burning incense sticks and cones.

source: བློ་གྲོས་བཟང་པོ་དང་། བློ་གྲོས་དང་། བུ་མོ་དེ་ཡང་པད་མ་ཁྱེར་ཏེ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མར་མེ་མཛད་ག་ལ་བ་དེར་དོང་བ་ལས། དེ་དག་སྐྱེ་བོ་ཕལ་པོ་ཆེ་མཆོད་པ་བྱེད་པས་གཏམས་ནས་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་མ་ཆུད་དོ། །
en: Sumati, Mati, and the young woman approached the totally and completely awakened Dīpaṃkara carrying their lotuses, but the place was crowded with worshipers, and they could not join the Blessed One’s audience.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དགོངས་པ།
en: “Thereupon the Blessed One thought,

source: སྐྱེ་བོ་ཕལ་པོ་ཆེ་འདི་རྣམས་པས་བྲམ་ཟེའི་ཁྱེའུ་བློ་གྲོས་བཟང་པོ་བསོད་ནམས་ཆེས་འཕེལ་བར་འགྱུར་རོ་སྙམ་དུ་དགོངས་ནས་རྫི་ཆར་དྲག་པོ་ཆེན་པོ་ཞིག་སྤྲུལ་ཏོ། །
en: ‘The young brahmin Sumati’s merit will increase more than that of all those in this great crowd,’ and he emanated a strong, gusty rain.

source: དེ་ནས་སྐྱེ་བོ་ཕལ་པོ་ཆེ་དེ་དག་གིས་གོ་སྐབས་ཕྱེ་ནས། བྲམ་ཟེའི་ཁྱེའུ་བློ་གྲོས་བཟང་པོས་སྐབས་ཐོད་དེ་བཅོམ་ལྡན་འདས་ལ་བལྟ་བས་ཆོག་མི་ཤེས་པ་མཐོང་ནས་ཤིན་ཏུ་དགའ་བ་སྐྱེས་སོ། །
en: After the great crowd of people had their chance, the young brahmin Sumati’s turn finally came. “As he beheld the captivating Blessed One he was elated.

source: དགའ་བ་སྐྱེས་ནས་ཨུད་པ་ལ་ལྔ་པོ་དེ་དག་བཅོམ་ལྡན་འདས་ལ་གཏོར་ཏོ། །
en: In his joy he scattered all five of his lotuses over the Blessed One,

source: དེ་ནས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མར་མེ་མཛད་ཀྱིས། དེ་དག་ཤིང་རྟའི་འཕང་ལོ་ཙམ་ཤ་སྟག་ཏུ་བླ་རེར་ཆགས་ཤིང་འདུག་ལ།
en: whereupon the totally and completely awakened Buddha Dīpaṃkara performed a miracle of transforming them all into a canopy above him, the size of a chariot wheel,

source: བཅོམ་ལྡན་འདས་གཤེགས་ན་ནི་འགྲོ་གཞེས་ན་ནི་སྡོད་པར་བྱིན་གྱིས་བརླབས་སོ། །
en: that moved when the Blessed One moved and remained still when he was still.

source: དེ་ནས་བུ་མོ་དེས་དེ་ལྟ་བུར་གྱུར་པ་མཐོང་ནས་དགའ་བ་སྐྱེས་ཏེ།
en: “When the young woman saw what had taken place, she was also filled with joy.
